---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarContainerParameterManager
source: html/a0e5db38-c482-7232-df45-b0cdbcebac7d.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerParameterManager

Provides implementation of RebarContainer parameters overrides.

## Syntax (C#)
```csharp
public class RebarContainerParameterManager : IDisposable
```

## Remarks
When a new override is created, by default, the parameter will show the overridden value as read-only.
 You can control whether or not the parameter is modifiable using SetOverriddenParameterReadonly(ElementId) and SetOverriddenParameterModifiable(ElementId) .a